      * DATA AREA FOR TERMINAL INPUT                                    01050000
       01  INPUT-MSG.                                                   01070000
           02  CUST-ID        PICTURE X(10).                   
                                                              
